app/Controllers/Admin/Branches.php

    public function index()
    {
        $branchModel = new BranchModel();
        $data = [
            'title' => 'Branch Locations | Insight Admin',
            'branches' => $branchModel->findAll()
---
SELECT *
FROM `branches`