app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $teamModel = new TeamModel();
        $serviceModel = new ServiceModel();
        $testimonialModel = new TestimonialModel();
        $faqModel = new FaqModel();
        $enquiryModel = new EnquiryModel();

        $data = [
            'title' => 'Dashboard | Insight Counseling Services',
            'teamCount' => $teamModel->countAllResults(),
            'servicesCount' => $serviceModel->countAllResults(),
            'testimonialsCount' => $testimonialModel->countAllResults(),
            'faqCount' => $faqModel->countAllResults(),
            'recentEnquiries' => $enquiryModel->orderBy('created_at', 'DESC')->findAll(5),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `testimonials`
SELECT COUNT(*) AS `numrows`
FROM `services`
SELECT COUNT(*) AS `numrows`
FROM `faqs`
SELECT *
FROM `enquiries`
ORDER BY `created_at` DESC
 LIMIT 5