app/Controllers/Admin/Enquiries.php

    public function delete($id)
    {
        $enquiryModel = new EnquiryModel();
        $enquiry = $enquiryModel->find($id);

        if ($enquiry) {
            $enquiryModel->delete($id);
            return redirect()->to(base_url('admin'))->with('success', 'Enquiry deleted successfully.');
---
SELECT *
FROM `enquiries`
ORDER BY `id` DESC