app/Controllers/Admin/Faq.php

SELECT *
FROM `faqs`
---
    public function index()
    {
        $faqModel = new FaqModel();
        $data = [
            'title' => 'FAQ Management | Insight Admin',
            'faqs' => $faqModel->findAll()