app/Controllers/Admin/Settings.php

    public function index()
    {
        $settingModel = new SettingModel();
        $settings = $settingModel->find(1);
---
SELECT *
FROM `settings`
WHERE `settings`.`id` = 1