app/Controllers/Admin/Testimonials.php

SELECT *
FROM `testimonials`
---
    public function index()
    {
        $testimonialModel = new TestimonialModel();
        $data = [
            'title' => 'Testimonials | Insight Admin',
            'testimonials' => $testimonialModel->findAll()