app/Controllers/Home.php

SELECT *
FROM `branches`
WHERE `status` = 1
---
    public function contact()
    {
        $branchModel = new BranchModel();
        $data = [
            'title' => 'Contact Us | Clinic Locations in Kovur, Porur & Ashok Nagar | Chennai',
            'meta_desc' => 'Contact Insight Counseling Services. Book an in-person or online consultation with expert psychologists in Kovur, Porur, and Ashok Nagar, Chennai.',
            'branches' => $branchModel->where('status', 1)->findAll()

SELECT *
FROM `services`
WHERE `slug` = 'stress-management'
AND `status` = 1
 LIMIT 1
---
    public function serviceDetail($slug)
    {
        $serviceModel = new ServiceModel();
        $service = $serviceModel->where('slug', $slug)->where('status', 1)->first();